*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. PB1075CC.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCALE LOC1 IS "C".
OBJECT-COMPUTER. X
    CHARACTER CLASSIFICATION FOR NATIONAL IS LOC1 FOR NATIONAL IS LOC1.
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
