*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. PB1075SORT.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    ALPHABET AL1 IS NATIVE.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SF ASSIGN TO "sf.tmp".
DATA DIVISION.
FILE SECTION.
SD SF.
01 SR.
   05 SK PIC X(2).
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
MAIN.
    SORT SF ON ASCENDING KEY SK
        COLLATING SEQUENCE FOR ALPHANUMERIC IS AL1 FOR ALPHANUMERIC IS AL1
        INPUT PROCEDURE IS INP OUTPUT PROCEDURE IS OUTP.
    STOP RUN.
INP.
    RELEASE SR.
OUTP.
    RETURN SF AT END CONTINUE END-RETURN.
