*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. PB1075CS.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    ALPHABET AL1 IS NATIVE.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F1 ASSIGN TO "f1.tmp" ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD F1 CODE-SET FOR ALPHANUMERIC IS AL1 FOR ALPHANUMERIC IS AL1.
01 R1 PIC X(2).
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
