      *> reject-at: 2002 2014 2023
      *> kb/Work PB1505 - ISO/IEC 1989:2023 section 11.3.3 SR3: "Object-class-name-2 shall not be the name of the class
      *> declared by this class definition."
      *>   cite.py: OK  11.3.3 3)
       IDENTIFICATION DIVISION.
       CLASS-ID. PB1505S INHERITS FROM PB1505S.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS PB1505S.
       END CLASS PB1505S.
