       01 L1G2-A PIC X(L1G2N).
       01 L1G2-B PIC 9(L1G2N)V9(L1G2N).
       01 PFX-NAME PIC X(4) VALUE "WXYZ".
       01 CNT-SFX PIC 9(2) VALUE 42.
